using UnityEngine;

public class RoadItem : MonoBehaviour
{
    public int type;
    //1.单行直线向右 2.单行直线向上 3.十字路口  4.U型车位上 5.U型车位右 6.U型车位下 7.U型车位左 8.多车道中间直线向右 9.多车道中间直线向上 
    //10.多车道上边直线向右 11.多车道右边直线向上 12.多车道下边直线向右 13.多车道左边直线向上 14.车位中间向上 15.车位中间向右 16.车位中间向下 17.车位中间向左
    //18.车位左边向上 19.车位右边向上 20.车位上边向右 21.车位下边向右 22.车位左边向下 23.车位右边向下 24.车位上边向左 25.车位下边向左
    //26.多车道人行道中间向右 27.多车道人行道中间向上 28.多车道人行道左边向右 29.多车道人行道右边向左 30.多车道人行道上边向下 31.多车道人行道下边向上
    //32.单车道人行道向下 33.但车道人行道向右
    //34.丁字路口向上 35.丁字路口向右 36.丁字路口向下 37.丁字路口向左 38.右转路口 39.左转路口 40.上转路口 41.下转路口
}
